src/cf/src/Documents/АктыВыполненныхРабот/АктыВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктыВыполненныхРабот</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСОрганизациями</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусАктаВыполненныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругаяСуммаСогласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетОтветственного</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗадач</name>
    <attributes>
      <name>Задача</name>
      <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
      <type>
        <types>TaskRef.ЗадачиПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Трудоемкость</name>
      <type>
        <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ВзаиморасчетыСОрганизациями/ВзаиморасчетыСОрганизациями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСОрганизациями</name>
  <resources>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/АктыВыполненныхРабот/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ВзаиморасчетыСОрганизациями.Записывать = Истина;
		
	Для Каждого ТекСтрокаСписокЗадач Из СписокЗадач Цикл
		
		Движение = Движения.ВзаиморасчетыСОрганизациями.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Задача = ТекСтрокаСписокЗадач.Задача;
		Движение.Исполнитель = ТекСтрокаСписокЗадач.Исполнитель;
		Движение.ФактическаяТрудоемкость = ТекСтрокаСписокЗадач.Трудоемкость;
		
	КонецЦикла;
	
	Движения.ВзаиморасчетыСОрганизациями.Записать();  // АПК:105 Явная запись для возможности контроля остатков. 
	
	// Контроль остатков трудоемкости.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВложенныйЗапрос.Задача КАК Задача,
	|	ВложенныйЗапрос.ФактическаяТрудоемкостьОстаток КАК ФактическаяТрудоемкостьОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВзаиморасчетыСОрганизациямиОстатки.Задача КАК Задача,
	|		СУММА(ВзаиморасчетыСОрганизациямиОстатки.ФактическаяТрудоемкостьОстаток) КАК ФактическаяТрудоемкостьОстаток
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСОрганизациями.Остатки(&ДатаСреза, Задача В (&СписокЗадач)) КАК ВзаиморасчетыСОрганизациямиОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВзаиморасчетыСОрганизациямиОстатки.Задача) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.ФактическаяТрудоемкостьОстаток < 0";
	
	
	Граница = Новый Граница(Дата, ВидГраницы.Включая);
	МоментВремениНаДату = Граница.Значение;
	Запрос.УстановитьПараметр("ДатаСреза", МоментВремениНаДату + 1);
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач.ВыгрузитьКолонку("Задача"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'По задаче %1: остаток выполненных часов меньше чем указано в акте.'"), Выборка.Задача);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Отказ = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
